app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    if @user.save
---
INSERT INTO "users" ("created_at", "email", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 24 Dec 2012 01:08:54 UTC +00:00], ["email", "peter@parker.com"], ["updated_at", Mon, 24 Dec 2012 01:08:54 UTC +00:00]]